grouper-ws/grouper-ws/doc/xmlExamples/groupSaveSimpleSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:groupSaveSimple xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:groupName>aStem:test</ns1:groupName>
      <ns1:groupUuid></ns1:groupUuid>
      <ns1:description>test group</ns1:description>
      <ns1:displayExtension>the test group</ns1:displayExtension>
      <ns1:retrieveViaNameIfNoUuid></ns1:retrieveViaNameIfNoUuid>
      <ns1:createGroupIfNotExist></ns1:createGroupIfNotExist>
      <ns1:createStemsIfNotExist></ns1:createStemsIfNotExist>
      <ns1:actAsSubjectId>GrouperSystem</ns1:actAsSubjectId>
      <ns1:actAsSubjectIdentifier></ns1:actAsSubjectIdentifier>
    </ns1:groupSaveSimple>
  </soapenv:Body>
</soapenv:Envelope>